{
   "name": "1 S'more for the Road and Kiddie S'mores",
   "recipeLink": "https://www.foodnetwork.com/recipes/jeff-mauro/1-smore-for-the-road-and-kiddie-smores-recipe-2033028",
   "ingredients": [
      "Nonstick canola oil spray",
      "1 pound marshmallow creme",
      "4 tablespoons unsalted butter, melted and cooled",
      "1/2 cup powdered sugar",
      "1/3 cup miniature chocolate-covered candies, such as M and M's, plus more for garnish",
      "2 tablespoons bourbon",
      "1 teaspoon vermouth",
      "1 teaspoon grenadine",
      "24 whole graham crackers, each broken carefully in half",
      "80 stackable marshmallows (2 bags)",
      "Six 4-ounce bars high-quality semisweet chocolate, chopped",
      "Optional serving suggestions: Manhattan's (for the adults) or chocolate milk (for the kids)"
   ],
   "directions": [
      "Coat a large microwave-safe bowl with nonstick spray. Add the marshmallow creme and microwave until warmed through and slightly puffed, 30 to 45 seconds. Add the butter and powdered sugar and whip with a hand mixer until light and fluffy, 1 to 2 minutes. Transfer half of the mixture to another bowl coated with nonstick spray and fold in the candies. Set aside until ready to use.",
      "Add the bourbon, vermouth and grenadine to the remaining marshmallow mixture and whip with a hand mixer until well combined. Set aside until ready to use.",
      "To build the \"1 s'more for the road\": On a cooling rack over a half baking sheet, lay down 32 of the graham cracker halves. Spread 1 1/2 teaspoons of the \"Manhattan\" marshmallow creme on each graham cracker half. Place 4 stackable marshmallows on 16 of the graham cracker halves. Top with the remaining graham cracker halves.",
      "To build the kiddie s'mores: On a cooling rack over a half baking sheet, lay down the remaining 16 graham cracker halves. Spread 1 tablespoon of \"kiddie\" marshmallow creme on each graham cracker half. Place 2 stackable marshmallows on 8 of the graham cracker halves. Top with the remaining graham cracker halves.",
      "In a metal bowl set over a saucepan with about 1 inch of simmering water in it, melt the semisweet chocolate over medium-low heat until completely smooth, stirring constantly, 5 to 7 minutes. Once the chocolate is melted, turn the heat off below the pan. Pour 2 tablespoons of the melted chocolate on top of each s'more, letting the chocolate drip down the sides. Once the s'mores are finished, let the chocolate harden at room temperature for an hour (or if you are in a hurry, then let set up in the refrigerator for 15 minutes).",
      "Serve with a side of Manhattans for the adults and some chocolate milk for the kids."
   ],
   "time": [
      " 2 hr",
      " 1 hr",
      " 2 hr",
      " 1 hr"
   ],
   "imageSrc": "food.fnr.sndimg.com/content/dam/images/food/fullset/2013/5/10/0/ZB0403H_kiddie-smores-recipe_s4x3.jpg.rend.hgtvcom.126.95.suffix/1371616409601.jpeg",
   "recipeYield": "Sixteen 1 S'more for the Road and 8 Kiddie S'mores",
   "categories": [
      "S'mores",
      "Bourbon",
      "Dessert",
      "Low Sodium"
   ]
}